Tekla.Structures.Drawing.Internal.MarkTagsExporter
MarkTagsExporter class provides tools to export/import tags for detail, section and view label marks

Tekla.Structures.Drawing.Internal.MarkTagsExporter.ExportDetailMarkTags(Tekla.Structures.Drawing.DetailMarkTagsAttributes)
Export detail mark tags to core
MarkTagsAttributes: Detail mark tag attributes
Returns: True on success.

Tekla.Structures.Drawing.Internal.MarkTagsExporter.ImportDetailMarkTags(Tekla.Structures.Drawing.DetailMarkTagsAttributes)
Import detail mark tags from core
MarkTagsAttributes: Detail mark tag attributes
Returns: True on success.

Tekla.Structures.Drawing.Internal.MarkTagsExporter.ExportSectionMarkTags(Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes)
Export section mark tags to core
MarkTagsAttributes: Section mark tag attributes
Returns: True on success.

Tekla.Structures.Drawing.Internal.MarkTagsExporter.ImportSectionMarkTags(Tekla.Structures.Drawing.SectionMarkBase.SectionMarkTagsAttributes)
Import section mark tags from core
MarkTagsAttributes: Section mark tag attributes
Returns: True on success.

Tekla.Structures.Drawing.Internal.MarkTagsExporter.ExportViewTags(Tekla.Structures.Drawing.View.ViewMarkTagsAttributes)
Export view mark tags to core
ViewTagsAttributes: View mark tag attributes
Returns: True on success.

Tekla.Structures.Drawing.Internal.MarkTagsExporter.ImportViewTags(Tekla.Structures.Drawing.View.ViewMarkTagsAttributes)
Import view mark tags to core
ViewTagsAttributes: View mark tag attributes
Returns: True on success.